nevinxu/HM502B2/platform/CMSIS/Include/device/MKL43Z4/MKL43Z4_mcg.h
/*******************************************************************************
 * HW_MCG_MC - MCG Miscellaneous Control Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_MC - MCG Miscellaneous Control Register (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_mc
{
    uint8_t U;
    struct _hw_mcg_mc_bitfields
    {
        uint8_t LIRC_DIV2 : 3;         /*!< [2:0] Second Low-frequency Internal
                                        * Reference Clock Divider */
        uint8_t RESERVED0 : 4;         /*!< [6:3]  */
        uint8_t HIRCEN : 1;            /*!< [7] High-frequency IRC Enable */
    } B;
} hw_mcg_mc_t;

/*!
 * @name Constants and macros for entire MCG_MC register
 */
/*@{*/
#define HW_MCG_MC_ADDR(x)        ((x) + 0x18U)

#define HW_MCG_MC(x)             (*(__IO hw_mcg_mc_t *) HW_MCG_MC_ADDR(x))
#define HW_MCG_MC_RD(x)          (HW_MCG_MC(x).U)
#define HW_MCG_MC_WR(x, v)       (HW_MCG_MC(x).U = (v))
#define HW_MCG_MC_SET(x, v)      (BME_OR8(HW_MCG_MC_ADDR(x), (uint8_t)(v)))
#define HW_MCG_MC_CLR(x, v)      (BME_AND8(HW_MCG_MC_ADDR(x), (uint8_t)(~(v))))
#define HW_MCG_MC_TOG(x, v)      (BME_XOR8(HW_MCG_MC_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual MCG_MC bitfields
 */

/*!
 * @name Register MCG_MC, field LIRC_DIV2[2:0] (RW)
 *
 * Selects the factor value to further divide the LIRC source.
 *
 * Values:
 * - 000 - Division factor is 1.
 * - 001 - Division factor is 2.
 * - 010 - Division factor is 4.
 * - 011 - Division factor is 8.
 * - 100 - Division factor is 16.
 * - 101 - Division factor is 32.
 * - 110 - Division factor is 64.
 * - 111 - Division factor is 128.
 */
/*@{*/
#define BP_MCG_MC_LIRC_DIV2  (0U)          /*!< Bit position for MCG_MC_LIRC_DIV2. */
#define BM_MCG_MC_LIRC_DIV2  (0x07U)       /*!< Bit mask for MCG_MC_LIRC_DIV2. */
#define BS_MCG_MC_LIRC_DIV2  (3U)          /*!< Bit field size in bits for MCG_MC_LIRC_DIV2. */

/*! @brief Read current value of the MCG_MC_LIRC_DIV2 field. */
#define BR_MCG_MC_LIRC_DIV2(x) (BME_UBFX8(HW_MCG_MC_ADDR(x), BP_MCG_MC_LIRC_DIV2, BS_MCG_MC_LIRC_DIV2))

/*! @brief Format value for bitfield MCG_MC_LIRC_DIV2. */
#define BF_MCG_MC_LIRC_DIV2(v) ((uint8_t)((uint8_t)(v) << BP_MCG_MC_LIRC_DIV2) & BM_MCG_MC_LIRC_DIV2)

/*! @brief Set the LIRC_DIV2 field to a new value. */
#define BW_MCG_MC_LIRC_DIV2(x, v) (BME_BFI8(HW_MCG_MC_ADDR(x), ((uint8_t)(v) << BP_MCG_MC_LIRC_DIV2), BP_MCG_MC_LIRC_DIV2, 3))
/*@}*/

/*!
 * @name Register MCG_MC, field HIRCEN[7] (RW)
 *
 * Enables the HIRC, even when MCG_Lite is not working at HIRC mode.
 *
 * Values:
 * - 0 - HIRC source is not enabled.
 * - 1 - HIRC source is enabled.
 */
/*@{*/
#define BP_MCG_MC_HIRCEN     (7U)          /*!< Bit position for MCG_MC_HIRCEN. */
#define BM_MCG_MC_HIRCEN     (0x80U)       /*!< Bit mask for MCG_MC_HIRCEN. */
#define BS_MCG_MC_HIRCEN     (1U)          /*!< Bit field size in bits for MCG_MC_HIRCEN. */

/*! @brief Read current value of the MCG_MC_HIRCEN field. */
#define BR_MCG_MC_HIRCEN(x)  (BME_UBFX8(HW_MCG_MC_ADDR(x), BP_MCG_MC_HIRCEN, BS_MCG_MC_HIRCEN))

/*! @brief Format value for bitfield MCG_MC_HIRCEN. */
#define BF_MCG_MC_HIRCEN(v)  ((uint8_t)((uint8_t)(v) << BP_MCG_MC_HIRCEN) & BM_MCG_MC_HIRCEN)

/*! @brief Set the HIRCEN field to a new value. */
#define BW_MCG_MC_HIRCEN(x, v) (BME_BFI8(HW_MCG_MC_ADDR(x), ((uint8_t)(v) << BP_MCG_MC_HIRCEN), BP_MCG_MC_HIRCEN, 1))
/*@}*/

/*******************************************************************************
 * HW_MCG_LTRIMRNG - MCG Low-frequency IRC Trim Range Register
 ******************************************************************************/

/*!
 * @brief HW_MCG_LTRIMRNG - MCG Low-frequency IRC Trim Range Register (RO)
 *
 * Reset value: 0x00U
 */
typedef union _hw_mcg_ltrimrng
{
    uint8_t U;
    struct _hw_mcg_ltrimrng_bitfields
    {
        uint8_t STRIMRNG : 2;          /*!< [1:0] LIRC Slow TRIM (2 MHz) Range */
        uint8_t FTRIMRNG : 2;          /*!< [3:2] LIRC Fast TRIM (8 MHz) Range */
        uint8_t RESERVED0 : 4;         /*!< [7:4]  */
    } B;
} hw_mcg_ltrimrng_t;

/*!
 * @name Constants and macros for entire MCG_LTRIMRNG register
 */
/*@{*/
#define HW_MCG_LTRIMRNG_ADDR(x)  ((x) + 0x19U)

#define HW_MCG_LTRIMRNG(x)       (*(__I hw_mcg_ltrimrng_t *) HW_MCG_LTRIMRNG_ADDR(x))
#define HW_MCG_LTRIMRNG_RD(x)    (HW_MCG_LTRIMRNG(x).U)
/*@}*/

/*
 * Constants & macros for individual MCG_LTRIMRNG bitfields
 */

/*!
 * @name Register MCG_LTRIMRNG, field STRIMRNG[1:0] (RO)
 *
 * Trim effect level of LSTRIM can be enlarged by setting this field. Loads from
 * a factory programmed location when out of reset.
 *
 * Values:
 * - 00 - Frequency shift by 10%.
 * - 01 - No frequency shift.
 * - 10 - No frequency shift.
 * - 11 - Frequency shift by -10%.
 */
/*@{*/
#define BP_MCG_LTRIMRNG_STRIMRNG (0U)      /*!< Bit position for MCG_LTRIMRNG_STRIMRNG. */
#define BM_MCG_LTRIMRNG_STRIMRNG (0x03U)   /*!< Bit mask for MCG_LTRIMRNG_STRIMRNG. */
#define BS_MCG_LTRIMRNG_STRIMRNG (2U)      /*!< Bit field size in bits for MCG_LTRIMRNG_STRIMRNG. */

/*! @brief Read current value of the MCG_LTRIMRNG_STRIMRNG field. */
#define BR_MCG_LTRIMRNG_STRIMRNG(x) (BME_UBFX8(HW_MCG_LTRIMRNG_ADDR(x), BP_MCG_LTRIMRNG_STRIMRNG, BS_MCG_LTRIMRNG_STRIMRNG))
/*@}*/

/*!
 * @name Register MCG_LTRIMRNG, field FTRIMRNG[3:2] (RO)
 *
 * Trim effect level of LFTRIM can be enlarged by setting this field. Loads from
 * a factory programmed location when out of reset.
 *
 * Values:
 * - 00 - Frequency shift by 10%.
 * - 01 - No frequency shift.
 * - 10 - No frequency shift.
 * - 11 - Frequency shift by -10%.
 */
/*@{*/
#define BP_MCG_LTRIMRNG_FTRIMRNG (2U)      /*!< Bit position for MCG_LTRIMRNG_FTRIMRNG. */
#define BM_MCG_LTRIMRNG_FTRIMRNG (0x0CU)   /*!< Bit mask for MCG_LTRIMRNG_FTRIMRNG. */
#define BS_MCG_LTRIMRNG_FTRIMRNG (2U)      /*!< Bit field size in bits for MCG_LTRIMRNG_FTRIMRNG. */

/*! @brief Read current value of the MCG_LTRIMRNG_FTRIMRNG field. */
#define BR_MCG_LTRIMRNG_FTRIMRNG(x) (BME_UBFX8(HW_MCG_LTRIMRNG_ADDR(x), BP_MCG_LTRIMRNG_FTRIMRNG, BS_MCG_LTRIMRNG_FTRIMRNG))
/*@}*/

